antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
RTC_NOINIT_ATTR static CrashLog crash_log;

static const char *reset_reason_str(uint8_t r)
{
  switch (r)
  {
    case ESP_RST_SW:         return "SW";
    case ESP_RST_PANIC:      return "PANIC";
    case ESP_RST_INT_WDT:    return "IWDT";
    case ESP_RST_TASK_WDT:   return "TWDT";
    case ESP_RST_WDT:        return "WDT";
    case ESP_RST_BROWNOUT:   return "BROWN";
    case ESP_RST_EFUSE:      return "EFUSE";
    case ESP_RST_PWR_GLITCH: return "GLITCH";
    case ESP_RST_CPU_LOCKUP: return "LOCKUP";
    default:                 return "RST";
  }
}

// Copy PC + task name out of a flash coredump into crash_log, then erase the
// dump so a stale one is never re-harvested after a later dump-less reset
// (e.g. RTC WDT, where the panic handler never ran).
static void harvest_coredump_summary()
{
  crash_log.pc = 0;
  crash_log.task[0] = '\0';
  crash_log.elf_sha[0] = '\0';
#ifdef CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH
  esp_core_dump_summary_t *sum =
      (esp_core_dump_summary_t *)calloc(1, sizeof(*sum));
  if (sum == NULL)
    return;
  if (esp_core_dump_get_summary(sum) == ESP_OK)
  {
    crash_log.pc = sum->exc_pc;
    memcpy(crash_log.task, sum->exc_task, sizeof(crash_log.task));
    crash_log.task[sizeof(crash_log.task) - 1] = '\0';
    // Already a hex string in the summary; keep the first 8 chars
    size_t sha_n = strnlen((const char *)sum->app_elf_sha256,
                           sizeof(crash_log.elf_sha) - 1);
    memcpy(crash_log.elf_sha, sum->app_elf_sha256, sha_n);
    crash_log.elf_sha[sha_n] = '\0';
    esp_core_dump_image_erase();
  }
  free(sum);
#endif
}

// Detect and record an abnormal reset. Must run before RTC state is used in
// anger, but after setup_serial() so the LOGI is visible.
static void crash_forensics_on_boot()
{
  esp_reset_reason_t rr = esp_reset_reason();
  if (crash_log.magic != CRASH_LOG_MAGIC)
  {
    // True power-on (or first firmware with CrashLog): noinit RAM is garbage
    memset(&crash_log, 0, sizeof(crash_log));
    crash_log.magic = CRASH_LOG_MAGIC;
  }
  else if (rr != ESP_RST_DEEPSLEEP && rr != ESP_RST_POWERON &&
           rr != ESP_RST_USB && rr != ESP_RST_JTAG && rr != ESP_RST_SDIO)
  {
    // USB/JTAG/SDIO excluded: flash-tool resets, not field crashes
    if (crash_log.crash_count < 255)
      crash_log.crash_count++;
    crash_log.last_reason     = (uint8_t)rr;
    crash_log.last_stage      = crash_log.stage;
    crash_log.last_boot_count = crash_log.cur_boot_count;
    crash_log.last_time       = crash_log.cur_time;
    harvest_coredump_summary();
    LOGI("Abnormal reset #%u: %s at boot %d stage %d pc 0x%x %s",
         (unsigned)crash_log.crash_count, reset_reason_str(crash_log.last_reason),
         (int)crash_log.last_boot_count, (int)crash_log.last_stage,
         (unsigned)crash_log.pc, crash_log.task);
  }
  crash_log.stage = STAGE_BOOT;
}

RTC_DATA_ATTR time_t first_boot_time = 0;
RTC_DATA_ATTR time_t next_clear_time = 0;
const time_t one_day = 86400;

RTC_DATA_ATTR float previous_temp = TEMP_NO_PREVIOUS;
RTC_DATA_ATTR int previous_boot_count = -1;

RTC_DATA_ATTR uint32_t max_battery_mv = 0;

RTC_DATA_ATTR uint32_t bad_pin27_count = 0;

// Min/max temperature since boot
RTC_DATA_ATTR float min_temp_since_boot = TEMP_INIT_MIN;
RTC_DATA_ATTR float max_temp_since_boot = TEMP_INIT_MAX;

// Periodic NTP resync state
RTC_DATA_ATTR time_t next_resync_time = 0;           // when to next attempt NTP resync
RTC_DATA_ATTR int32_t resync_interval_s = 7 * 86400; // current interval (starts at 1 week)
RTC_DATA_ATTR int32_t last_drift_ms = 0;             // drift measured at last resync (positive = clock ahead)
RTC_DATA_ATTR int32_t last_resync_interval_s = 0;    // interval at time of last drift measurement
RTC_DATA_ATTR time_t last_sync_time = 0;             // wall-clock of last successful NTP sync (0 = never)

// Status flags for display error indicators
RTC_DATA_ATTR bool wifi_ok = false;
RTC_DATA_ATTR bool ntp_synced = false;
RTC_DATA_ATTR bool last_sensor_ok = true;

// Update the hourly history buffer with a new temperature reading.
// Called on every main CPU wake (both delta-triggered and safety-net timer).
// When the clock hour changes, the accumulated entry is finalized and appended
// to the circular buffer. Any skipped hours (shouldn't happen normally since
// the safety net wakes every hour) are filled with sentinel entries.
static void update_hourly_history(time_t now, const struct tm *nowtm, float temp)
{
  int16_t temp_x10 = (int16_t)(temp * 10);

  // Compute wall-clock start-of-hour for current local time
  struct tm hour_tm = *nowtm;
  hour_tm.tm_min = 0;
  hour_tm.tm_sec = 0;
  time_t hour_start = mktime(&hour_tm);

  if (historical_data.current_hour_start != 0 && hour_start != historical_data.current_hour_start)
  {
    // Clock hour changed — finalize the completed hour's entry
    HourlyEntry entry;
    entry.min_x10 = historical_data.current_hour_min_x10;
    entry.max_x10 = historical_data.current_hour_max_x10;
    entry.avg_x10 = (historical_data.current_hour_sample_count > 0)
      ? (int16_t)(historical_data.current_hour_sum_x10 / historical_data.current_hour_sample_count)
      : historical_data.current_hour_min_x10;

    historical_data.hourly[historical_data.hourly_idx] = entry;
    historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
    if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
      historical_data.hourly_count++;

    // Fill any skipped hours with the finalized entry's values.
    // Skipped hours mean the ULP safety-net woke but no delta was detected,
    // so temperature was stable — the last known value is the best estimate.
    // Uses time_t difference (UTC-based) so DST transitions are handled
    // correctly — a "spring forward" skip produces one fill, a "fall back"
    // repeat produces hours_elapsed=0 (no fill needed).
    int hours_elapsed = (int)((hour_start - historical_data.current_hour_start) / 3600);
    if (hours_elapsed > HOURLY_HISTORY_SIZE)
      hours_elapsed = HOURLY_HISTORY_SIZE;
    for (int i = 1; i < hours_elapsed; i++)
    {
      historical_data.hourly[historical_data.hourly_idx] = entry;  // repeat last known value
      historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
      if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
        historical_data.hourly_count++;
    }

    // Update reference time: the last written entry's start-of-hour
    historical_data.hourly_latest_time = hour_start - 3600;

    // Reset accumulator for the new hour
    historical_data.current_hour_sum_x10 = 0;
    historical_data.current_hour_sample_count = 0;
    historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
    historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  }

