antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
// Radio fully off before deep sleep (matches former WiFi.disconnect(true, true)).
// Handlers unregister before deinit and the stopping flag stays set throughout,
// so a late STA_DISCONNECTED can't call esp_wifi_connect() on a dead driver.
static void wifi_disconnect()
{
  s_wifi_stopping = true;
  esp_wifi_stop();
  if (s_wifi_handler)
  {
    esp_event_handler_instance_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, s_wifi_handler);
    s_wifi_handler = nullptr;
  }
  if (s_ip_handler)
  {
    esp_event_handler_instance_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, s_ip_handler);
    s_ip_handler = nullptr;
  }
  esp_wifi_deinit();
  s_wifi_stopping = false;
}

static bool wifi_connect()
{
  esp_err_t err = nvs_flash_init(); // esp_wifi_init() requires NVS
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND)
  {
    nvs_flash_erase();
    err = nvs_flash_init();
  }
  if (err != ESP_OK)
  {
    LOGI("NVS init failed: 0x%x", err);
    return false;
  }

  // Degrade to "NO WIFI" on any init failure (the Arduino path never aborted);
  // a panic here would boot-loop a battery device instead of rendering a frame.
#define WIFI_TRY(x)                                        \
  do {                                                     \
    esp_err_t _e = (x);                                    \
    if (_e != ESP_OK)                                      \
    {                                                      \
      LOGI("WiFi setup failed (%s): " #x, esp_err_to_name(_e)); \
      wifi_disconnect();                                   \
      return false;                                        \
    }                                                      \
  } while (0)

  WIFI_TRY(esp_netif_init());
  err = esp_event_loop_create_default();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) // INVALID_STATE = already created
  {
    LOGI("Event loop creation failed: 0x%x", err);
    return false;
  }
  static esp_netif_t *sta_netif = nullptr;
  if (!sta_netif)
    sta_netif = esp_netif_create_default_wifi_sta();
  if (!sta_netif)
  {
    LOGI("WiFi setup failed: no STA netif");
    return false;
  }

  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  WIFI_TRY(esp_wifi_init(&cfg));

  if (!s_wifi_events)
    s_wifi_events = xEventGroupCreate();
  xEventGroupClearBits(s_wifi_events, WIFI_CONNECTED_BIT);
  WIFI_TRY(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                               &wifi_event_handler, nullptr, &s_wifi_handler));
  WIFI_TRY(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                               &wifi_event_handler, nullptr, &s_ip_handler));

  wifi_config_t wcfg = {};
  strncpy((char *)wcfg.sta.ssid, MY_WIFI_SSID, sizeof(wcfg.sta.ssid) - 1);
  strncpy((char *)wcfg.sta.password, MY_WIFI_PASSWORD, sizeof(wcfg.sta.password) - 1);
  WIFI_TRY(esp_wifi_set_storage(WIFI_STORAGE_RAM)); // reconfigured every boot; skip NVS writes
  WIFI_TRY(esp_wifi_set_mode(WIFI_MODE_STA));
  WIFI_TRY(esp_wifi_set_config(WIFI_IF_STA, &wcfg));
  WIFI_TRY(esp_wifi_start());
#undef WIFI_TRY

  LOGI("Waiting for WiFi");
  EventBits_t bits = xEventGroupWaitBits(s_wifi_events, WIFI_CONNECTED_BIT,
                                         pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_TIMEOUT_MS));
  if (!(bits & WIFI_CONNECTED_BIT))
  {
    LOGI("WiFi connection timed out after %u ms", (unsigned)WIFI_TIMEOUT_MS);
    wifi_disconnect();
    return false;
  }
  return true;
}

// One-shot SNTP sync: fresh instance, wait for a genuinely new time response.
static bool sntp_sync_once(uint32_t timeout_ms)
{
  esp_sntp_config_t scfg = {};
  scfg.start = true;
  scfg.wait_for_sync = true;
  scfg.num_of_servers = 1;
  scfg.servers[0] = "pool.ntp.org";
#if CONFIG_LWIP_SNTP_MAX_SERVERS >= 2
  scfg.num_of_servers = 2;
  scfg.servers[1] = "time.google.com";
#endif
  if (esp_netif_sntp_init(&scfg) != ESP_OK)
    return false;
  bool ok = (esp_netif_sntp_sync_wait(pdMS_TO_TICKS(timeout_ms)) == ESP_OK);
  esp_netif_sntp_deinit();
  return ok;
}

// Minimum resync interval (1 day) — floor to avoid hammering WiFi
#define RESYNC_INTERVAL_MIN  (86400)
// Maximum resync interval (4 weeks)
#define RESYNC_INTERVAL_MAX  (28 * 86400)

// Attempt NTP resync if due. Measures clock drift and adjusts next interval.
static void maybe_ntp_resync(time_t now)
{
  if (!ntp_synced)
    return;  // never synced — nothing to resync against
  if (next_resync_time == 0)
  {
    // First call after boot — schedule initial resync
    next_resync_time = now + resync_interval_s;
    return;
  }
  if (now < next_resync_time)
    return;

  LOGI("NTP resync: connecting to WiFi");
  if (!wifi_connect())
  {
    LOGI("NTP resync: WiFi failed, deferring to next scheduled resync");
    next_resync_time = now + resync_interval_s;
    return;
  }

  // Capture pre-sync time for drift measurement
  time_t before_sync;
  time(&before_sync);

  // Fresh SNTP instance waits for a genuinely new time response. The clock is
  // already set (just drifted), so anything that returns early on a valid-
  // looking clock would measure ~0 drift and never actually correct it.
  if (!sntp_sync_once(30000U))
  {
    LOGI("NTP resync: sync failed, deferring to next scheduled resync");
    wifi_disconnect();
    next_resync_time = now + resync_interval_s;
    return;
  }

  time_t after_sync;
  time(&after_sync);
  last_sync_time = after_sync;

  // Drift = what the clock said before sync minus what NTP says now.
  // Positive = clock was ahead, negative = clock was behind.
  // after_sync is the corrected time; before_sync was the drifted time.
  last_drift_ms = (int32_t)(before_sync - after_sync) * 1000;
  last_resync_interval_s = resync_interval_s;
  LOGI("NTP resync: drift was %d ms (interval was %d s)",
       (int)last_drift_ms, (int)resync_interval_s);

  // Only shorten the interval if drift is significant (>= 1 minute).
  // For a low-fidelity EPD thermometer display, sub-minute drift is invisible.
  int32_t abs_drift = abs(last_drift_ms);
  if (abs_drift >= 60000)
  {
    // Aim for <60s drift at next resync.
    // target = 60 * interval_s * 1000 / abs_drift_ms
    int32_t target = (int32_t)((60LL * resync_interval_s * 1000) / abs_drift);
    if (target < RESYNC_INTERVAL_MIN)
      target = RESYNC_INTERVAL_MIN;
    if (target > RESYNC_INTERVAL_MAX)
      target = RESYNC_INTERVAL_MAX;
    resync_interval_s = target;
    LOGI("NTP resync: significant drift, interval adjusted to %d s (%d h)",
         (int)resync_interval_s, (int)(resync_interval_s / 3600));
  }
  else
  {
    // Drift < 1 minute — double the interval (capped)
    if (resync_interval_s < RESYNC_INTERVAL_MAX / 2)
      resync_interval_s *= 2;
    else
      resync_interval_s = RESYNC_INTERVAL_MAX;
    LOGI("NTP resync: drift negligible, extending interval to %d s (%d h)",
         (int)resync_interval_s, (int)(resync_interval_s / 3600));
  }

  wifi_disconnect();
  next_resync_time = after_sync + resync_interval_s;
}
#endif // DISABLE_WIFI

// Battery thresholds (mV).
#if defined(ARDUINO_XIAO_ESP32C6)
// The XIAO's 3V3 rail is a pure buck (SGM6029C): at VBAT ≤3.6V it enters a
// bootstrap-starvation sag band (rail sags ~VTH below VIN; wakes collapse it
// into 0.5-0.9A brownout-restart storms; 30Hz sawtooth at 3.3V). Fine sweep
// 2026-07-05 (docs/notes.md): 3.7V is the lowest verified-healthy point,
// 3.6V is already inside the sag band — so shut down at the electrical
// cliff, not the battery's own limit (~12-15% SoC abandoned per OCV curve).
// Only meaningful once read_battery_level() gets a real VBAT source here.
const uint32_t low_battery_mv = 3800;
const uint32_t no_battery_mv = 3700;
#else
// https://dlnmh9ip6v2uc.cloudfront.net/datasheets/Prototyping/TP4056.pdf
// https://www.best-microcontroller-projects.com/tp4056.html
const uint32_t low_battery_mv = 3200;
const uint32_t no_battery_mv = 3000; // Controller stops delivering current at 2.9V
#endif

uint32_t read_battery_level()
{
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  // https://dfimg.dfrobot.com/nobody/wiki/fd28d987619c16281bdc4f40990e5a1c.PDF => looks like 1M/1M divider == x2 ratio
  // GPIO34 (A2) = ADC1 channel 6
  // On ADC failure return a value in the low-battery band: visible on the
  // display as a warning, but above no_battery_mv so a transient ADC error
  // can never trigger the permanent shutdown in handle_permanent_shutdown().
  const uint32_t adc_fail_mv = 3100;

