antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  update_temp_extremes(temp);
  update_hourly_history(now, &nowtm, temp);

  LOGI("now: %ld. next clear time: %ld. first boot time: %ld. prev_temp: %.1f",
       (long)now, (long)next_clear_time, (long)first_boot_time, previous_temp);
#ifdef MOCK_DISPLAY_DATA
  // Override sensor reading to match mock data range so it doesn't
  // distort the chart Y-axis (DummySensor returns a constant 12.3°C)
  temp = 22.3f;
#endif
  // RENDER covers both the periodic clear and the refresh below — either can
  // die mid-EPD-write (SPI, busy-wait light sleep, panel power)
  crash_log.stage = STAGE_RENDER;

#ifdef CRASH_TEST_BOOT
  // Deliberate crash to exercise the forensics path on hardware — flash with
  //   PLATFORMIO_BUILD_FLAGS="-DCRASH_TEST_BOOT=3" pio run -e <env> -t upload
  // (add -DCRASH_TEST_HANG to test the task-WDT→panic path instead of a null
  // deref). Fires on the first wake at/after that boot count, once per RTC
  // power cycle: the crash_count guard stops a crash loop, and also means a
  // second test needs a power cycle (which clears the CrashLog) first.
  if (boot_count >= CRASH_TEST_BOOT && crash_log.crash_count == 0)
  {
    LOGI("CRASH_TEST_BOOT: deliberately crashing at boot %d", boot_count);
    fflush(stdout);
#ifdef CRASH_TEST_HANG
    while (true) {}                    // starve idle task → TWDT → panic
#else
    *(volatile uint32_t *)0 = 0xdead;  // store to NULL → panic + coredump
#endif
  }
#endif
  bool should_refresh = periodic_display_clear(now, nowtm) ||
                         fabsf(temp - previous_temp) >= DISPLAY_TEMP_DELTA;
  if (!should_refresh)
  {
    LOGI("temperature hasn't changed significantly, no need to refresh display");
  }
  else
  {
    display_refresh_count++;
    if (max_battery_mv < battery_mv)
      max_battery_mv = battery_mv;

    temp_history_record(historical_data.temp, &historical_data.temp_count,
                        now, (int16_t)(temp * 10));

    PPK2_DISPLAY_HIGH();
    display_show_temperature(temp, battery_mv, battery_mv < low_battery_mv,
                             now, &nowtm, make_display_stats());
    PPK2_DISPLAY_LOW();

    previous_temp = temp;
    previous_boot_count = boot_count;
  }

  // Only (re)load the LP/ULP program on a fresh boot. On deep-sleep wakes
  // the LP core is still running with its existing configuration — reloading
  // the binary would wipe its counters and is not needed. Must test the
  // CACHED cause: by this point the EPD light sleeps have overwritten the
  // live one, and querying it here re-inited the LP core on every refresh.
  if (sensor.SupportsUlp()
      && s_wake_cause == ESP_SLEEP_WAKEUP_UNDEFINED)
  {
    crash_log.stage = STAGE_LP_INIT;
    ulp_reinit_count++;
    sensor.InitializeUlp();
  }

  start_deep_sleep();
}


// Reset history buffers (sparkline + hourly).
// Called when the history data format changes (struct layout, buffer sizes).
static void reset_rtc_history()
{
  memset(&historical_data, 0, sizeof(historical_data));
  historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
  historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  historical_data.version = RTC_HISTORY_VERSION;
  historical_data.self_addr = (uint32_t)&historical_data;
}

// Reset operational state (counters, flags, thresholds).
// Called when non-history RTC variables change. Preserves history.
static void reset_rtc_state()
{
  boot_count = 0;
  display_refresh_count = 0;
  ulp_reinit_count = 0;
  first_boot_time = 0;
  next_clear_time = 0;
  previous_temp = TEMP_NO_PREVIOUS;
  previous_boot_count = -1;
  max_battery_mv = 0;
  bad_pin27_count = 0;
  min_temp_since_boot = TEMP_INIT_MIN;
  max_temp_since_boot = TEMP_INIT_MAX;
  next_resync_time = 0;
  resync_interval_s = 7 * 86400;
  last_drift_ms = 0;
  last_resync_interval_s = 0;
  last_sync_time = 0;
  wifi_ok = false;
  ntp_synced = false;
  last_sensor_ok = true;
  rtc_state_version = RTC_STATE_VERSION;
}

void setup()
{
  // Must run before anything that can light-sleep (see s_wake_cause).
  s_wake_causes_raw = app_wakeup_causes_raw();
  s_wake_cause = app_wakeup_cause();

  setup_serial();
  crash_forensics_on_boot();

#if defined(HAS_ULP_SUPPORT) && defined(SOC_ULP_FSM_SUPPORTED)
  ulp_check_data_overlap();  // abort immediately if ULP data overlaps RTC variables
#endif

#ifdef PPK2_DEBUG
  gpio_out_init(PPK2_PIN_CPU_ACTIVE);
  gpio_out_init(PPK2_PIN_DISPLAY);
#endif
  PPK2_CPU_ACTIVE_HIGH();

  // Detect stale RTC memory from a different firmware version.
  // Three checks: version tag mismatch (format changed), address shift
  // (linker moved the struct due to other RTC variable changes), and
  // state version mismatch (non-history RTC variables changed).
  if (historical_data.version != RTC_HISTORY_VERSION ||
      historical_data.self_addr != (uint32_t)&historical_data)
  {
    if (historical_data.version != RTC_HISTORY_VERSION)
      LOGI("RTC history version mismatch — resetting history");
    else
      LOGI("RTC history address shifted (was 0x%08x, now 0x%08x) — resetting history",
           (unsigned)historical_data.self_addr, (unsigned)(uint32_t)&historical_data);
    reset_rtc_history();
    reset_rtc_state();
  }
  else if (rtc_state_version != RTC_STATE_VERSION)
  {
    LOGI("RTC state version mismatch — resetting state (history preserved)");
    reset_rtc_state();
  }

  boot_count++;
  crash_log.cur_boot_count = boot_count;
  // CPU frequency is fixed at 80 MHz at build time (CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ)
  // — replaces the Arduino-era setCpuFrequencyMhz(80) on non-first boots.

  LOGI("Boot count: %d [%s] sizeof(TempReading)=%d sizeof(time_t)=%d",
       boot_count, GIT_HASH, (int)sizeof(TempReading), (int)sizeof(time_t));

  // Diagnostic: dump sparkline buffer to detect packed struct corruption
  if (historical_data.temp_count > 0)
  {
    LOGI("Sparkline: count=%d", historical_data.temp_count);
    for (int i = 0; i < historical_data.temp_count; i++)
    {
      LOGI("  [%d] ts=%lld temp_x10=%d",
           i,
           (long long)historical_data.temp[i].timestamp,
           (int)historical_data.temp[i].temp_x10);
    }
  }

  esp_sleep_wakeup_cause_t wakeup_cause = s_wake_cause;
  LOGI("Wakeup caused by %d (raw 0x%x)", (int)wakeup_cause, (unsigned)s_wake_causes_raw);

  uint32_t battery_mv = read_battery_level();

  handle_permanent_shutdown(battery_mv);

  if ((wakeup_cause == ESP_SLEEP_WAKEUP_ULP || wakeup_cause == ESP_SLEEP_WAKEUP_TIMER)
      && sensor.SupportsUlp())
  {
    float temp;
    crash_log.stage = STAGE_ULP_READ;
    if (sensor.ReadUlpTemperature(&temp, previous_temp))
    {
      last_sensor_ok = true;
      refresh_and_sleep(battery_mv, temp);
      return; // never reached
    }
    // ULP I2C error — fall through to normal sensor read
    last_sensor_ok = false;
  }

  if (boot_count == 1)
  {
    initialize_status_led();
    on_first_boot();
    clear_status_led(); // TODO: double check that this stops drawing power
  }

#ifdef MOCK_DISPLAY_DATA
  // Fill mock data if history is empty (handles both first boot and stale RTC
  // memory after firmware upload without power-cycle)
  if (historical_data.temp_count == 0)
  {
    time_t mock_now;
    struct tm mock_nowtm;
    get_time(&mock_now, &mock_nowtm);
    fill_mock_data(mock_now);
    // Force display refresh by invalidating previous_temp
    previous_temp = TEMP_NO_PREVIOUS;
  }
#endif

  crash_log.stage = STAGE_SENSOR;
  float temp = read_temperature();
  refresh_and_sleep(battery_mv, temp);
}

extern "C" void app_main(void)
{
  setup(); // deep-sleeps at the end; never returns
}
